testlog/thread8client50/arcus-sync_16:27:59/onlyGetLongtail/memtier.log
Pseudo-terminal will not be allocated because stdin is not a terminal.

============== Configuration values: ==============
===================================================
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 0%,   1 secs]  8 threads:      165937 ops,  165784 (avg:  165784) ops/sec, 16.23MB/sec (avg: 16.23MB/sec),  2.41 (avg:  2.41) msec latency
[RUN #1 1%,   2 secs]  8 threads:      339074 ops,  173077 (avg:  169429) ops/sec, 16.95MB/sec (avg: 16.59MB/sec),  2.31 (avg:  2.35) msec latency
[RUN #1 1%,   3 secs]  8 threads:      509710 ops,  170576 (avg:  169811) ops/sec, 16.71MB/sec (avg: 16.63MB/sec),  2.34 (avg:  2.35) msec latency
[RUN #1 1%,   4 secs]  8 threads:      676513 ops,  166759 (avg:  169048) ops/sec, 16.33MB/sec (avg: 16.56MB/sec),  2.39 (avg:  2.36) msec latency
[RUN #1 2%,   5 secs]  8 threads:      851823 ops,  175266 (avg:  170292) ops/sec, 17.15MB/sec (avg: 16.67MB/sec),  2.28 (avg:  2.34) msec latency
[RUN #1 2%,   6 secs]  8 threads:     1033509 ops,  181642 (avg:  172183) ops/sec, 17.78MB/sec (avg: 16.86MB/sec),  2.20 (avg:  2.32) msec latency
[RUN #1 2%,   7 secs]  8 threads:     1218219 ops,  184665 (avg:  173966) ops/sec, 18.08MB/sec (avg: 17.03MB/sec),  2.16 (avg:  2.29) msec latency
[RUN #1 3%,   8 secs]  8 threads:     1403554 ops,  185288 (avg:  175381) ops/sec, 18.15MB/sec (avg: 17.17MB/sec),  2.16 (avg:  2.28) msec latency
[RUN #1 3%,   9 secs]  8 threads:     1603719 ops,  200052 (avg:  178123) ops/sec, 19.58MB/sec (avg: 17.44MB/sec),  1.99 (avg:  2.24) msec latency
[RUN #1 4%,  10 secs]  8 threads:     1788077 ops,  184317 (avg:  178742) ops/sec, 18.04MB/sec (avg: 17.50MB/sec),  2.17 (avg:  2.23) msec latency
[RUN #1 4%,  11 secs]  8 threads:     1959860 ops,  171740 (avg:  178106) ops/sec, 16.80MB/sec (avg: 17.44MB/sec),  2.32 (avg:  2.24) msec latency
[RUN #1 4%,  12 secs]  8 threads:     2140397 ops,  180491 (avg:  178304) ops/sec, 17.67MB/sec (avg: 17.46MB/sec),  2.21 (avg:  2.24) msec latency
[RUN #1 5%,  13 secs]  8 threads:     2331779 ops,  191335 (avg:  179307) ops/sec, 18.74MB/sec (avg: 17.55MB/sec),  2.09 (avg:  2.23) msec latency
[RUN #1 5%,  14 secs]  8 threads:     2509071 ops,  177248 (avg:  179160) ops/sec, 17.37MB/sec (avg: 17.54MB/sec),  2.25 (avg:  2.23) msec latency
[RUN #1 5%,  15 secs]  8 threads:     2689951 ops,  180829 (avg:  179271) ops/sec, 17.71MB/sec (avg: 17.55MB/sec),  2.21 (avg:  2.23) msec latency
[RUN #1 6%,  16 secs]  8 threads:     2860998 ops,  170855 (avg:  178745) ops/sec, 16.72MB/sec (avg: 17.50MB/sec),  2.34 (avg:  2.23) msec latency
[RUN #1 6%,  17 secs]  8 threads:     3036756 ops,  175707 (avg:  178566) ops/sec, 17.20MB/sec (avg: 17.48MB/sec),  2.27 (avg:  2.23) msec latency
[RUN #1 6%,  18 secs]  8 threads:     3196429 ops,  159632 (avg:  177514) ops/sec, 15.63MB/sec (avg: 17.38MB/sec),  2.50 (avg:  2.25) msec latency
[RUN #1 7%,  19 secs]  8 threads:     3387040 ops,  190564 (avg:  178201) ops/sec, 18.65MB/sec (avg: 17.45MB/sec),  2.09 (avg:  2.24) msec latency
[RUN #1 7%,  20 secs]  8 threads:     3578572 ops,  191487 (avg:  178865) ops/sec, 18.75MB/sec (avg: 17.51MB/sec),  2.07 (avg:  2.23) msec latency
[RUN #1 8%,  21 secs]  8 threads:     3751192 ops,  172579 (avg:  178566) ops/sec, 16.90MB/sec (avg: 17.48MB/sec),  2.33 (avg:  2.23) msec latency
[RUN #1 8%,  22 secs]  8 threads:     3937779 ops,  186543 (avg:  178928) ops/sec, 18.27MB/sec (avg: 17.52MB/sec),  2.14 (avg:  2.23) msec latency
[RUN #1 8%,  23 secs]  8 threads:     4128892 ops,  191076 (avg:  179456) ops/sec, 18.72MB/sec (avg: 17.57MB/sec),  2.09 (avg:  2.22) msec latency
[RUN #1 9%,  24 secs]  8 threads:     4327311 ops,  198378 (avg:  180245) ops/sec, 19.42MB/sec (avg: 17.65MB/sec),  2.01 (avg:  2.21) msec latency
[RUN #1 9%,  25 secs]  8 threads:     4518096 ops,  190748 (avg:  180665) ops/sec, 18.68MB/sec (avg: 17.69MB/sec),  2.09 (avg:  2.21) msec latency
[RUN #1 9%,  26 secs]  8 threads:     4697947 ops,  179809 (avg:  180632) ops/sec, 17.61MB/sec (avg: 17.69MB/sec),  2.22 (avg:  2.21) msec latency
[RUN #1 10%,  27 secs]  8 threads:     4894002 ops,  196012 (avg:  181201) ops/sec, 19.20MB/sec (avg: 17.74MB/sec),  2.04 (avg:  2.20) msec latency
[RUN #1 10%,  28 secs]  8 threads:     5090723 ops,  196674 (avg:  181754) ops/sec, 19.27MB/sec (avg: 17.80MB/sec),  2.03 (avg:  2.20) msec latency
[RUN #1 11%,  29 secs]  8 threads:     5299508 ops,  208735 (avg:  182684) ops/sec, 20.43MB/sec (avg: 17.89MB/sec),  1.91 (avg:  2.18) msec latency
[RUN #1 11%,  30 secs]  8 threads:     5499376 ops,  199819 (avg:  183255) ops/sec, 19.57MB/sec (avg: 17.94MB/sec),  2.00 (avg:  2.18) msec latency
[RUN #1 11%,  31 secs]  8 threads:     5687687 ops,  188269 (avg:  183417) ops/sec, 18.42MB/sec (avg: 17.96MB/sec),  2.12 (avg:  2.18) msec latency
[RUN #1 12%,  32 secs]  8 threads:     5873471 ops,  185740 (avg:  183490) ops/sec, 18.17MB/sec (avg: 17.97MB/sec),  2.15 (avg:  2.17) msec latency
[RUN #1 12%,  33 secs]  8 threads:     6065648 ops,  192130 (avg:  183752) ops/sec, 18.81MB/sec (avg: 17.99MB/sec),  2.07 (avg:  2.17) msec latency
[RUN #1 12%,  34 secs]  8 threads:     6238649 ops,  172964 (avg:  183434) ops/sec, 16.92MB/sec (avg: 17.96MB/sec),  2.32 (avg:  2.18) msec latency
[RUN #1 13%,  35 secs]  8 threads:     6428616 ops,  189925 (avg:  183620) ops/sec, 18.59MB/sec (avg: 17.98MB/sec),  2.10 (avg:  2.17) msec latency
[RUN #1 13%,  36 secs]  8 threads:     6616252 ops,  187594 (avg:  183730) ops/sec, 18.36MB/sec (avg: 17.99MB/sec),  2.13 (avg:  2.17) msec latency
[RUN #1 14%,  37 secs]  8 threads:     6802648 ops,  186349 (avg:  183801) ops/sec, 18.24MB/sec (avg: 17.99MB/sec),  2.14 (avg:  2.17) msec latency
[RUN #1 14%,  38 secs]  8 threads:     6994430 ops,  191739 (avg:  184010) ops/sec, 18.77MB/sec (avg: 18.02MB/sec),  2.08 (avg:  2.17) msec latency
[RUN #1 14%,  39 secs]  8 threads:     7184160 ops,  189685 (avg:  184155) ops/sec, 18.56MB/sec (avg: 18.03MB/sec),  2.10 (avg:  2.17) msec latency
[RUN #1 15%,  40 secs]  8 threads:     7388746 ops,  204541 (avg:  184665) ops/sec, 20.03MB/sec (avg: 18.08MB/sec),  1.95 (avg:  2.16) msec latency
[RUN #1 15%,  41 secs]  8 threads:     7577438 ops,  188645 (avg:  184762) ops/sec, 18.46MB/sec (avg: 18.09MB/sec),  2.12 (avg:  2.16) msec latency
[RUN #1 16%,  42 secs]  8 threads:     7751933 ops,  174449 (avg:  184516) ops/sec, 17.08MB/sec (avg: 18.06MB/sec),  2.29 (avg:  2.16) msec latency
[RUN #1 16%,  43 secs]  8 threads:     7922403 ops,  170430 (avg:  184189) ops/sec, 16.67MB/sec (avg: 18.03MB/sec),  2.34 (avg:  2.17) msec latency
[RUN #1 16%,  44 secs]  8 threads:     8106230 ops,  183785 (avg:  184180) ops/sec, 17.99MB/sec (avg: 18.03MB/sec),  2.17 (avg:  2.17) msec latency
[RUN #1 17%,  45 secs]  8 threads:     8287342 ops,  181060 (avg:  184110) ops/sec, 17.74MB/sec (avg: 18.02MB/sec),  2.19 (avg:  2.17) msec latency
[RUN #1 17%,  46 secs]  8 threads:     8474993 ops,  187608 (avg:  184186) ops/sec, 18.36MB/sec (avg: 18.03MB/sec),  2.14 (avg:  2.17) msec latency
[RUN #1 17%,  47 secs]  8 threads:     8670016 ops,  194979 (avg:  184416) ops/sec, 19.07MB/sec (avg: 18.05MB/sec),  2.05 (avg:  2.16) msec latency
[RUN #1 18%,  48 secs]  8 threads:     8857993 ops,  187937 (avg:  184489) ops/sec, 18.39MB/sec (avg: 18.06MB/sec),  2.12 (avg:  2.16) msec latency
[RUN #1 18%,  49 secs]  8 threads:     9049192 ops,  191157 (avg:  184625) ops/sec, 18.72MB/sec (avg: 18.07MB/sec),  2.09 (avg:  2.16) msec latency
[RUN #1 18%,  50 secs]  8 threads:     9240476 ops,  191238 (avg:  184758) ops/sec, 18.71MB/sec (avg: 18.09MB/sec),  2.09 (avg:  2.16) msec latency
[RUN #1 19%,  51 secs]  8 threads:     9424664 ops,  184147 (avg:  184746) ops/sec, 18.02MB/sec (avg: 18.09MB/sec),  2.17 (avg:  2.16) msec latency
[RUN #1 19%,  52 secs]  8 threads:     9602275 ops,  177571 (avg:  184608) ops/sec, 17.38MB/sec (avg: 18.07MB/sec),  2.25 (avg:  2.16) msec latency
[RUN #1 20%,  53 secs]  8 threads:     9784617 ops,  182300 (avg:  184564) ops/sec, 17.83MB/sec (avg: 18.07MB/sec),  2.19 (avg:  2.16) msec latency
[RUN #1 20%,  54 secs]  8 threads:     9967788 ops,  183129 (avg:  184538) ops/sec, 17.94MB/sec (avg: 18.07MB/sec),  2.18 (avg:  2.16) msec latency
[RUN #1 20%,  55 secs]  8 threads:    10152395 ops,  184572 (avg:  184538) ops/sec, 18.07MB/sec (avg: 18.07MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 21%,  56 secs]  8 threads:    10343941 ops,  191502 (avg:  184663) ops/sec, 18.74MB/sec (avg: 18.08MB/sec),  2.08 (avg:  2.16) msec latency
[RUN #1 21%,  57 secs]  8 threads:    10539218 ops,  195231 (avg:  184848) ops/sec, 19.11MB/sec (avg: 18.10MB/sec),  2.04 (avg:  2.16) msec latency
[RUN #1 21%,  58 secs]  8 threads:    10723653 ops,  184395 (avg:  184840) ops/sec, 18.04MB/sec (avg: 18.09MB/sec),  2.18 (avg:  2.16) msec latency
[RUN #1 22%,  59 secs]  8 threads:    10891620 ops,  167921 (avg:  184553) ops/sec, 16.44MB/sec (avg: 18.07MB/sec),  2.38 (avg:  2.16) msec latency
[RUN #1 22%,  60 secs]  8 threads:    11075690 ops,  183543 (avg:  184536) ops/sec, 17.98MB/sec (avg: 18.07MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 23%,  61 secs]  8 threads:    11259341 ops,  183610 (avg:  184521) ops/sec, 17.97MB/sec (avg: 18.06MB/sec),  2.18 (avg:  2.16) msec latency
[RUN #1 23%,  62 secs]  8 threads:    11444136 ops,  184286 (avg:  184517) ops/sec, 18.05MB/sec (avg: 18.06MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 23%,  63 secs]  8 threads:    11645835 ops,  201651 (avg:  184789) ops/sec, 19.74MB/sec (avg: 18.09MB/sec),  1.98 (avg:  2.16) msec latency
[RUN #1 24%,  64 secs]  8 threads:    11830461 ops,  184582 (avg:  184786) ops/sec, 18.07MB/sec (avg: 18.09MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 24%,  65 secs]  8 threads:    12011407 ops,  180904 (avg:  184726) ops/sec, 17.72MB/sec (avg: 18.08MB/sec),  2.19 (avg:  2.16) msec latency
[RUN #1 24%,  66 secs]  8 threads:    12148608 ops,  137165 (avg:  184006) ops/sec, 13.43MB/sec (avg: 18.01MB/sec),  2.96 (avg:  2.17) msec latency
[RUN #1 25%,  67 secs]  8 threads:    12331789 ops,  183134 (avg:  183993) ops/sec, 17.93MB/sec (avg: 18.01MB/sec),  2.15 (avg:  2.17) msec latency
[RUN #1 25%,  68 secs]  8 threads:    12532573 ops,  200744 (avg:  184239) ops/sec, 19.65MB/sec (avg: 18.04MB/sec),  1.98 (avg:  2.17) msec latency
[RUN #1 25%,  69 secs]  8 threads:    12736897 ops,  204284 (avg:  184530) ops/sec, 19.99MB/sec (avg: 18.06MB/sec),  1.95 (avg:  2.16) msec latency
[RUN #1 26%,  70 secs]  8 threads:    12927539 ops,  190594 (avg:  184616) ops/sec, 18.65MB/sec (avg: 18.07MB/sec),  2.09 (avg:  2.16) msec latency
[RUN #1 26%,  71 secs]  8 threads:    13120082 ops,  192490 (avg:  184727) ops/sec, 18.85MB/sec (avg: 18.08MB/sec),  2.07 (avg:  2.16) msec latency
[RUN #1 27%,  72 secs]  8 threads:    13324294 ops,  204154 (avg:  184997) ops/sec, 20.00MB/sec (avg: 18.11MB/sec),  1.96 (avg:  2.16) msec latency
[RUN #1 27%,  73 secs]  8 threads:    13510841 ops,  186497 (avg:  185018) ops/sec, 18.26MB/sec (avg: 18.11MB/sec),  2.14 (avg:  2.16) msec latency
[RUN #1 27%,  74 secs]  8 threads:    13675198 ops,  164317 (avg:  184738) ops/sec, 16.07MB/sec (avg: 18.08MB/sec),  2.43 (avg:  2.16) msec latency
[RUN #1 28%,  75 secs]  8 threads:    13857734 ops,  182493 (avg:  184708) ops/sec, 17.87MB/sec (avg: 18.08MB/sec),  2.19 (avg:  2.16) msec latency
[RUN #1 28%,  76 secs]  8 threads:    14055947 ops,  198165 (avg:  184885) ops/sec, 19.41MB/sec (avg: 18.10MB/sec),  2.01 (avg:  2.16) msec latency
[RUN #1 28%,  77 secs]  8 threads:    14223930 ops,  167945 (avg:  184665) ops/sec, 16.44MB/sec (avg: 18.08MB/sec),  2.38 (avg:  2.16) msec latency
[RUN #1 29%,  78 secs]  8 threads:    14412698 ops,  188728 (avg:  184717) ops/sec, 18.49MB/sec (avg: 18.08MB/sec),  2.12 (avg:  2.16) msec latency
[RUN #1 29%,  79 secs]  8 threads:    14610551 ops,  197803 (avg:  184883) ops/sec, 19.36MB/sec (avg: 18.10MB/sec),  2.02 (avg:  2.16) msec latency
[RUN #1 30%,  80 secs]  8 threads:    14822015 ops,  211413 (avg:  185214) ops/sec, 20.70MB/sec (avg: 18.13MB/sec),  1.89 (avg:  2.15) msec latency
[RUN #1 30%,  81 secs]  8 threads:    15029999 ops,  207940 (avg:  185495) ops/sec, 20.36MB/sec (avg: 18.16MB/sec),  1.92 (avg:  2.15) msec latency
[RUN #1 30%,  82 secs]  8 threads:    15229376 ops,  199333 (avg:  185664) ops/sec, 19.51MB/sec (avg: 18.18MB/sec),  2.00 (avg:  2.15) msec latency
[RUN #1 31%,  83 secs]  8 threads:    15422055 ops,  192632 (avg:  185748) ops/sec, 18.85MB/sec (avg: 18.18MB/sec),  2.07 (avg:  2.15) msec latency
[RUN #1 31%,  84 secs]  8 threads:    15592203 ops,  170111 (avg:  185561) ops/sec, 16.66MB/sec (avg: 18.17MB/sec),  2.35 (avg:  2.15) msec latency
[RUN #1 32%,  85 secs]  8 threads:    15769276 ops,  177034 (avg:  185461) ops/sec, 17.34MB/sec (avg: 18.16MB/sec),  2.24 (avg:  2.15) msec latency
[RUN #1 32%,  86 secs]  8 threads:    15949671 ops,  180357 (avg:  185402) ops/sec, 17.66MB/sec (avg: 18.15MB/sec),  2.23 (avg:  2.15) msec latency
[RUN #1 32%,  87 secs]  8 threads:    16148813 ops,  199005 (avg:  185558) ops/sec, 19.48MB/sec (avg: 18.17MB/sec),  2.01 (avg:  2.15) msec latency
[RUN #1 33%,  88 secs]  8 threads:    16347402 ops,  198449 (avg:  185705) ops/sec, 19.44MB/sec (avg: 18.18MB/sec),  2.01 (avg:  2.15) msec latency
[RUN #1 33%,  89 secs]  8 threads:    16555327 ops,  207878 (avg:  185954) ops/sec, 20.35MB/sec (avg: 18.20MB/sec),  1.91 (avg:  2.15) msec latency
[RUN #1 34%,  90 secs]  8 threads:    16759237 ops,  203867 (avg:  186153) ops/sec, 19.96MB/sec (avg: 18.22MB/sec),  1.97 (avg:  2.14) msec latency
[RUN #1 34%,  91 secs]  8 threads:    16959755 ops,  200471 (avg:  186310) ops/sec, 19.64MB/sec (avg: 18.24MB/sec),  1.99 (avg:  2.14) msec latency
[RUN #1 34%,  92 secs]  8 threads:    17166008 ops,  206177 (avg:  186526) ops/sec, 20.18MB/sec (avg: 18.26MB/sec),  1.94 (avg:  2.14) msec latency
[RUN #1 35%,  93 secs]  8 threads:    17344828 ops,  178777 (avg:  186443) ops/sec, 17.51MB/sec (avg: 18.25MB/sec),  2.23 (avg:  2.14) msec latency
[RUN #1 35%,  94 secs]  8 threads:    17552028 ops,  207156 (avg:  186663) ops/sec, 20.28MB/sec (avg: 18.27MB/sec),  1.93 (avg:  2.14) msec latency
[RUN #1 35%,  95 secs]  8 threads:    17737193 ops,  185125 (avg:  186647) ops/sec, 18.12MB/sec (avg: 18.27MB/sec),  2.16 (avg:  2.14) msec latency
[RUN #1 36%,  96 secs]  8 threads:    17915335 ops,  178103 (avg:  186558) ops/sec, 17.43MB/sec (avg: 18.26MB/sec),  2.24 (avg:  2.14) msec latency
[RUN #1 36%,  97 secs]  8 threads:    18088350 ops,  172974 (avg:  186418) ops/sec, 16.94MB/sec (avg: 18.25MB/sec),  2.31 (avg:  2.14) msec latency
[RUN #1 37%,  98 secs]  8 threads:    18282191 ops,  193803 (avg:  186493) ops/sec, 18.97MB/sec (avg: 18.26MB/sec),  2.07 (avg:  2.14) msec latency
[RUN #1 37%,  99 secs]  8 threads:    18464919 ops,  182690 (avg:  186455) ops/sec, 17.89MB/sec (avg: 18.25MB/sec),  2.18 (avg:  2.14) msec latency
[RUN #1 37%, 100 secs]  8 threads:    18659204 ops,  194241 (avg:  186533) ops/sec, 19.02MB/sec (avg: 18.26MB/sec),  2.05 (avg:  2.14) msec latency
[RUN #1 38%, 101 secs]  8 threads:    18847253 ops,  188005 (avg:  186547) ops/sec, 18.41MB/sec (avg: 18.26MB/sec),  2.12 (avg:  2.14) msec latency
[RUN #1 38%, 102 secs]  8 threads:    19034238 ops,  186941 (avg:  186551) ops/sec, 18.31MB/sec (avg: 18.26MB/sec),  2.13 (avg:  2.14) msec latency
[RUN #1 38%, 103 secs]  8 threads:    19202791 ops,  168517 (avg:  186376) ops/sec, 16.49MB/sec (avg: 18.25MB/sec),  2.37 (avg:  2.14) msec latency
[RUN #1 39%, 104 secs]  8 threads:    19365257 ops,  162428 (avg:  186146) ops/sec, 15.91MB/sec (avg: 18.22MB/sec),  2.46 (avg:  2.14) msec latency
[RUN #1 39%, 105 secs]  8 threads:    19561083 ops,  195786 (avg:  186238) ops/sec, 19.18MB/sec (avg: 18.23MB/sec),  2.04 (avg:  2.14) msec latency
[RUN #1 40%, 106 secs]  8 threads:    19755619 ops,  194490 (avg:  186315) ops/sec, 19.03MB/sec (avg: 18.24MB/sec),  2.05 (avg:  2.14) msec latency
[RUN #1 40%, 107 secs]  8 threads:    19929912 ops,  174246 (avg:  186203) ops/sec, 17.07MB/sec (avg: 18.23MB/sec),  2.29 (avg:  2.14) msec latency
[RUN #1 40%, 108 secs]  8 threads:    20118813 ops,  188857 (avg:  186227) ops/sec, 18.51MB/sec (avg: 18.23MB/sec),  2.11 (avg:  2.14) msec latency
[RUN #1 41%, 109 secs]  8 threads:    20295774 ops,  176927 (avg:  186142) ops/sec, 17.30MB/sec (avg: 18.22MB/sec),  2.25 (avg:  2.14) msec latency
[RUN #1 41%, 110 secs]  8 threads:    20474693 ops,  178864 (avg:  186076) ops/sec, 17.51MB/sec (avg: 18.22MB/sec),  2.23 (avg:  2.14) msec latency
[RUN #1 41%, 111 secs]  8 threads:    20651733 ops,  176998 (avg:  185994) ops/sec, 17.34MB/sec (avg: 18.21MB/sec),  2.25 (avg:  2.15) msec latency
[RUN #1 42%, 112 secs]  8 threads:    20831457 ops,  179686 (avg:  185938) ops/sec, 17.58MB/sec (avg: 18.20MB/sec),  2.23 (avg:  2.15) msec latency
[RUN #1 42%, 113 secs]  8 threads:    21014915 ops,  183421 (avg:  185915) ops/sec, 17.95MB/sec (avg: 18.20MB/sec),  2.16 (avg:  2.15) msec latency
[RUN #1 42%, 114 secs]  8 threads:    21170568 ops,  155616 (avg:  185650) ops/sec, 15.23MB/sec (avg: 18.18MB/sec),  2.58 (avg:  2.15) msec latency
[RUN #1 43%, 115 secs]  8 threads:    21333710 ops,  162969 (avg:  185452) ops/sec, 15.95MB/sec (avg: 18.16MB/sec),  2.45 (avg:  2.15) msec latency
[RUN #1 43%, 116 secs]  8 threads:    21515075 ops,  181317 (avg:  185417) ops/sec, 17.74MB/sec (avg: 18.15MB/sec),  2.18 (avg:  2.15) msec latency
[RUN #1 43%, 117 secs]  8 threads:    21692249 ops,  177132 (avg:  185346) ops/sec, 17.34MB/sec (avg: 18.15MB/sec),  2.24 (avg:  2.15) msec latency
[RUN #1 44%, 118 secs]  8 threads:    21877402 ops,  185108 (avg:  185344) ops/sec, 18.14MB/sec (avg: 18.15MB/sec),  2.18 (avg:  2.15) msec latency
[RUN #1 44%, 119 secs]  8 threads:    22046916 ops,  169471 (avg:  185210) ops/sec, 16.60MB/sec (avg: 18.13MB/sec),  2.36 (avg:  2.15) msec latency
[RUN #1 44%, 120 secs]  8 threads:    22243937 ops,  196975 (avg:  185308) ops/sec, 19.27MB/sec (avg: 18.14MB/sec),  2.04 (avg:  2.15) msec latency
[RUN #1 45%, 121 secs]  8 threads:    22429697 ops,  185712 (avg:  185312) ops/sec, 18.17MB/sec (avg: 18.14MB/sec),  2.13 (avg:  2.15) msec latency
[RUN #1 45%, 122 secs]  8 threads:    22616733 ops,  186997 (avg:  185326) ops/sec, 18.31MB/sec (avg: 18.14MB/sec),  2.13 (avg:  2.15) msec latency
[RUN #1 46%, 123 secs]  8 threads:    22795048 ops,  178272 (avg:  185268) ops/sec, 17.46MB/sec (avg: 18.14MB/sec),  2.24 (avg:  2.15) msec latency
[RUN #1 46%, 124 secs]  8 threads:    22980735 ops,  185642 (avg:  185271) ops/sec, 18.16MB/sec (avg: 18.14MB/sec),  2.13 (avg:  2.15) msec latency
[RUN #1 46%, 125 secs]  8 threads:    23153927 ops,  173155 (avg:  185174) ops/sec, 16.96MB/sec (avg: 18.13MB/sec),  2.36 (avg:  2.16) msec latency
[RUN #1 47%, 126 secs]  8 threads:    23326454 ops,  172365 (avg:  185073) ops/sec, 16.87MB/sec (avg: 18.12MB/sec),  2.28 (avg:  2.16) msec latency
[RUN #1 47%, 127 secs]  8 threads:    23507783 ops,  181289 (avg:  185043) ops/sec, 17.74MB/sec (avg: 18.12MB/sec),  2.19 (avg:  2.16) msec latency
[RUN #1 47%, 128 secs]  8 threads:    23707499 ops,  199669 (avg:  185157) ops/sec, 19.55MB/sec (avg: 18.13MB/sec),  2.00 (avg:  2.16) msec latency
[RUN #1 48%, 129 secs]  8 threads:    23902218 ops,  194667 (avg:  185231) ops/sec, 19.06MB/sec (avg: 18.13MB/sec),  2.02 (avg:  2.15) msec latency
[RUN #1 48%, 130 secs]  8 threads:    23992237 ops,   89985 (avg:  184498) ops/sec, 8.80MB/sec (avg: 18.06MB/sec),  4.57 (avg:  2.16) msec latency
[RUN #1 48%, 131 secs]  8 threads:    24196071 ops,  203780 (avg:  184645) ops/sec, 19.95MB/sec (avg: 18.08MB/sec),  1.96 (avg:  2.16) msec latency
[RUN #1 49%, 132 secs]  8 threads:    24379523 ops,  183369 (avg:  184636) ops/sec, 17.94MB/sec (avg: 18.08MB/sec),  2.17 (avg:  2.16) msec latency
[RUN #1 49%, 133 secs]  8 threads:    24565070 ops,  185498 (avg:  184642) ops/sec, 18.15MB/sec (avg: 18.08MB/sec),  2.15 (avg:  2.16) msec latency
[RUN #1 49%, 134 secs]  8 threads:    24749690 ops,  184571 (avg:  184642) ops/sec, 18.06MB/sec (avg: 18.08MB/sec),  2.14 (avg:  2.16) msec latency
[RUN #1 50%, 135 secs]  8 threads:    24932958 ops,  183225 (avg:  184631) ops/sec, 17.93MB/sec (avg: 18.07MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 50%, 136 secs]  8 threads:    25112243 ops,  179239 (avg:  184591) ops/sec, 17.55MB/sec (avg: 18.07MB/sec),  2.27 (avg:  2.16) msec latency
[RUN #1 51%, 137 secs]  8 threads:    25289075 ops,  176795 (avg:  184535) ops/sec, 17.31MB/sec (avg: 18.07MB/sec),  2.20 (avg:  2.16) msec latency
[RUN #1 51%, 138 secs]  8 threads:    25449990 ops,  160876 (avg:  184363) ops/sec, 15.74MB/sec (avg: 18.05MB/sec),  2.55 (avg:  2.17) msec latency
[RUN #1 51%, 139 secs]  8 threads:    25616558 ops,  166528 (avg:  184235) ops/sec, 16.30MB/sec (avg: 18.04MB/sec),  2.34 (avg:  2.17) msec latency
[RUN #1 52%, 140 secs]  8 threads:    25807019 ops,  190415 (avg:  184279) ops/sec, 18.67MB/sec (avg: 18.04MB/sec),  2.12 (avg:  2.17) msec latency
[RUN #1 52%, 141 secs]  8 threads:    26007473 ops,  200405 (avg:  184393) ops/sec, 19.62MB/sec (avg: 18.05MB/sec),  1.98 (avg:  2.16) msec latency
[RUN #1 52%, 142 secs]  8 threads:    26213138 ops,  205605 (avg:  184543) ops/sec, 20.13MB/sec (avg: 18.07MB/sec),  1.95 (avg:  2.16) msec latency
[RUN #1 53%, 143 secs]  8 threads:    26419676 ops,  206491 (avg:  184696) ops/sec, 20.22MB/sec (avg: 18.08MB/sec),  1.96 (avg:  2.16) msec latency
[RUN #1 53%, 144 secs]  8 threads:    26609661 ops,  189863 (avg:  184732) ops/sec, 18.58MB/sec (avg: 18.08MB/sec),  2.09 (avg:  2.16) msec latency
[RUN #1 54%, 145 secs]  8 threads:    26794152 ops,  184440 (avg:  184730) ops/sec, 18.05MB/sec (avg: 18.08MB/sec),  2.18 (avg:  2.16) msec latency
[RUN #1 54%, 146 secs]  8 threads:    26995056 ops,  200849 (avg:  184840) ops/sec, 19.66MB/sec (avg: 18.10MB/sec),  1.98 (avg:  2.16) msec latency
[RUN #1 54%, 147 secs]  8 threads:    27195277 ops,  200166 (avg:  184945) ops/sec, 19.60MB/sec (avg: 18.11MB/sec),  1.99 (avg:  2.16) msec latency
[RUN #1 55%, 148 secs]  8 threads:    27399198 ops,  203872 (avg:  185073) ops/sec, 19.96MB/sec (avg: 18.12MB/sec),  1.94 (avg:  2.16) msec latency
[RUN #1 55%, 149 secs]  8 threads:    27603194 ops,  203898 (avg:  185199) ops/sec, 19.96MB/sec (avg: 18.13MB/sec),  1.95 (avg:  2.16) msec latency
[RUN #1 56%, 150 secs]  8 threads:    27773614 ops,  170370 (avg:  185100) ops/sec, 16.69MB/sec (avg: 18.12MB/sec),  2.38 (avg:  2.16) msec latency
[RUN #1 56%, 151 secs]  8 threads:    27958287 ops,  184631 (avg:  185097) ops/sec, 18.07MB/sec (avg: 18.12MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 56%, 152 secs]  8 threads:    28147147 ops,  188808 (avg:  185121) ops/sec, 18.48MB/sec (avg: 18.12MB/sec),  2.11 (avg:  2.16) msec latency
[RUN #1 57%, 153 secs]  8 threads:    28332747 ops,  185510 (avg:  185124) ops/sec, 18.17MB/sec (avg: 18.12MB/sec),  2.13 (avg:  2.16) msec latency
[RUN #1 57%, 154 secs]  8 threads:    28518888 ops,  186099 (avg:  185130) ops/sec, 18.23MB/sec (avg: 18.12MB/sec),  2.12 (avg:  2.16) msec latency
[RUN #1 57%, 155 secs]  8 threads:    28705785 ops,  186852 (avg:  185141) ops/sec, 18.28MB/sec (avg: 18.13MB/sec),  2.16 (avg:  2.16) msec latency
[RUN #1 58%, 156 secs]  8 threads:    28892527 ops,  186655 (avg:  185151) ops/sec, 18.28MB/sec (avg: 18.13MB/sec),  2.15 (avg:  2.16) msec latency
[RUN #1 58%, 157 secs]  8 threads:    29078792 ops,  186220 (avg:  185158) ops/sec, 18.22MB/sec (avg: 18.13MB/sec),  2.15 (avg:  2.16) msec latency
[RUN #1 59%, 158 secs]  8 threads:    29277608 ops,  198752 (avg:  185244) ops/sec, 19.45MB/sec (avg: 18.14MB/sec),  1.99 (avg:  2.15) msec latency
[RUN #1 59%, 159 secs]  8 threads:    29465500 ops,  187750 (avg:  185260) ops/sec, 18.38MB/sec (avg: 18.14MB/sec),  2.12 (avg:  2.15) msec latency
[RUN #1 59%, 160 secs]  8 threads:    29649351 ops,  183806 (avg:  185251) ops/sec, 18.01MB/sec (avg: 18.14MB/sec),  2.19 (avg:  2.15) msec latency
[RUN #1 60%, 161 secs]  8 threads:    29838849 ops,  189446 (avg:  185277) ops/sec, 18.53MB/sec (avg: 18.14MB/sec),  2.12 (avg:  2.15) msec latency
[RUN #1 60%, 162 secs]  8 threads:    30016581 ops,  177680 (avg:  185230) ops/sec, 17.39MB/sec (avg: 18.13MB/sec),  2.25 (avg:  2.15) msec latency
[RUN #1 60%, 163 secs]  8 threads:    30200254 ops,  183625 (avg:  185220) ops/sec, 17.99MB/sec (avg: 18.13MB/sec),  2.17 (avg:  2.16) msec latency
[RUN #1 61%, 164 secs]  8 threads:    30386086 ops,  185784 (avg:  185223) ops/sec, 18.20MB/sec (avg: 18.13MB/sec),  2.15 (avg:  2.15) msec latency
[RUN #1 61%, 165 secs]  8 threads:    30579287 ops,  192966 (avg:  185270) ops/sec, 18.90MB/sec (avg: 18.14MB/sec),  2.06 (avg:  2.15) msec latency
[RUN #1 62%, 166 secs]  8 threads:    30783775 ops,  204445 (avg:  185386) ops/sec, 20.01MB/sec (avg: 18.15MB/sec),  1.92 (avg:  2.15) msec latency
[RUN #1 62%, 167 secs]  8 threads:    30976968 ops,  193152 (avg:  185432) ops/sec, 18.91MB/sec (avg: 18.15MB/sec),  2.11 (avg:  2.15) msec latency
[RUN #1 62%, 168 secs]  8 threads:    31185764 ops,  208722 (avg:  185571) ops/sec, 20.42MB/sec (avg: 18.17MB/sec),  1.91 (avg:  2.15) msec latency
[RUN #1 63%, 169 secs]  8 threads:    31376775 ops,  190965 (avg:  185603) ops/sec, 18.69MB/sec (avg: 18.17MB/sec),  2.09 (avg:  2.15) msec latency
[RUN #1 63%, 170 secs]  8 threads:    31569963 ops,  193132 (avg:  185647) ops/sec, 18.90MB/sec (avg: 18.17MB/sec),  2.07 (avg:  2.15) msec latency
[RUN #1 64%, 171 secs]  8 threads:    31764893 ops,  194895 (avg:  185701) ops/sec, 19.09MB/sec (avg: 18.18MB/sec),  1.99 (avg:  2.15) msec latency
[RUN #1 64%, 172 secs]  8 threads:    31949300 ops,  184345 (avg:  185693) ops/sec, 18.05MB/sec (avg: 18.18MB/sec),  2.23 (avg:  2.15) msec latency
[RUN #1 64%, 173 secs]  8 threads:    32131200 ops,  181847 (avg:  185671) ops/sec, 17.80MB/sec (avg: 18.18MB/sec),  2.20 (avg:  2.15) msec latency
[RUN #1 65%, 174 secs]  8 threads:    32334727 ops,  203471 (avg:  185773) ops/sec, 19.92MB/sec (avg: 18.19MB/sec),  1.93 (avg:  2.15) msec latency
[RUN #1 65%, 175 secs]  8 threads:    32530127 ops,  195340 (avg:  185828) ops/sec, 19.13MB/sec (avg: 18.19MB/sec),  2.07 (avg:  2.15) msec latency
[RUN #1 65%, 176 secs]  8 threads:    32717777 ops,  187580 (avg:  185838) ops/sec, 18.36MB/sec (avg: 18.19MB/sec),  2.13 (avg:  2.15) msec latency
[RUN #1 66%, 177 secs]  8 threads:    32919976 ops,  202153 (avg:  185930) ops/sec, 19.78MB/sec (avg: 18.20MB/sec),  1.97 (avg:  2.15) msec latency
[RUN #1 66%, 178 secs]  8 threads:    33113355 ops,  193332 (avg:  185972) ops/sec, 18.91MB/sec (avg: 18.21MB/sec),  2.06 (avg:  2.15) msec latency
[RUN #1 67%, 179 secs]  8 threads:    33300443 ops,  187031 (avg:  185978) ops/sec, 18.31MB/sec (avg: 18.21MB/sec),  2.13 (avg:  2.15) msec latency
[RUN #1 67%, 180 secs]  8 threads:    33499938 ops,  199427 (avg:  186052) ops/sec, 19.53MB/sec (avg: 18.21MB/sec),  2.00 (avg:  2.15) msec latency
[RUN #1 67%, 181 secs]  8 threads:    33704247 ops,  204279 (avg:  186153) ops/sec, 19.99MB/sec (avg: 18.22MB/sec),  1.96 (avg:  2.14) msec latency
[RUN #1 68%, 182 secs]  8 threads:    33894688 ops,  190389 (avg:  186176) ops/sec, 18.64MB/sec (avg: 18.23MB/sec),  2.09 (avg:  2.14) msec latency
[RUN #1 68%, 183 secs]  8 threads:    34080604 ops,  185868 (avg:  186175) ops/sec, 18.20MB/sec (avg: 18.23MB/sec),  2.14 (avg:  2.14) msec latency
[RUN #1 69%, 184 secs]  8 threads:    34262761 ops,  182095 (avg:  186153) ops/sec, 17.83MB/sec (avg: 18.22MB/sec),  2.20 (avg:  2.14) msec latency
[RUN #1 69%, 185 secs]  8 threads:    34437804 ops,  174889 (avg:  186092) ops/sec, 17.11MB/sec (avg: 18.22MB/sec),  2.28 (avg:  2.14) msec latency
[RUN #1 69%, 186 secs]  8 threads:    34614005 ops,  176153 (avg:  186038) ops/sec, 17.24MB/sec (avg: 18.21MB/sec),  2.27 (avg:  2.15) msec latency
[RUN #1 70%, 187 secs]  8 threads:    34805028 ops,  190888 (avg:  186064) ops/sec, 18.69MB/sec (avg: 18.22MB/sec),  2.09 (avg:  2.15) msec latency
[RUN #1 70%, 188 secs]  8 threads:    34971339 ops,  166244 (avg:  185959) ops/sec, 16.28MB/sec (avg: 18.20MB/sec),  2.40 (avg:  2.15) msec latency
[RUN #1 70%, 189 secs]  8 threads:    35146147 ops,  174760 (avg:  185899) ops/sec, 17.10MB/sec (avg: 18.20MB/sec),  2.29 (avg:  2.15) msec latency
[RUN #1 71%, 190 secs]  8 threads:    35345210 ops,  198986 (avg:  185968) ops/sec, 19.49MB/sec (avg: 18.21MB/sec),  2.01 (avg:  2.15) msec latency
[RUN #1 71%, 191 secs]  8 threads:    35530151 ops,  184881 (avg:  185963) ops/sec, 18.10MB/sec (avg: 18.21MB/sec),  2.16 (avg:  2.15) msec latency
[RUN #1 71%, 192 secs]  8 threads:    35705180 ops,  174989 (avg:  185905) ops/sec, 17.14MB/sec (avg: 18.20MB/sec),  2.28 (avg:  2.15) msec latency
[RUN #1 72%, 193 secs]  8 threads:    35903613 ops,  198382 (avg:  185970) ops/sec, 19.41MB/sec (avg: 18.21MB/sec),  2.01 (avg:  2.15) msec latency
[RUN #1 72%, 194 secs]  8 threads:    36089770 ops,  186109 (avg:  185971) ops/sec, 18.22MB/sec (avg: 18.21MB/sec),  2.14 (avg:  2.15) msec latency
[RUN #1 73%, 195 secs]  8 threads:    36285227 ops,  195406 (avg:  186019) ops/sec, 19.14MB/sec (avg: 18.21MB/sec),  2.05 (avg:  2.15) msec latency
[RUN #1 73%, 196 secs]  8 threads:    36474114 ops,  188841 (avg:  186034) ops/sec, 18.48MB/sec (avg: 18.21MB/sec),  2.11 (avg:  2.15) msec latency
[RUN #1 73%, 197 secs]  8 threads:    36658302 ops,  184099 (avg:  186024) ops/sec, 18.03MB/sec (avg: 18.21MB/sec),  2.17 (avg:  2.15) msec latency
[RUN #1 74%, 198 secs]  8 threads:    36847777 ops,  189423 (avg:  186041) ops/sec, 18.54MB/sec (avg: 18.21MB/sec),  2.10 (avg:  2.15) msec latency
[RUN #1 74%, 199 secs]  8 threads:    37025904 ops,  178092 (avg:  186001) ops/sec, 17.44MB/sec (avg: 18.21MB/sec),  2.24 (avg:  2.15) msec latency
[RUN #1 74%, 200 secs]  8 threads:    37218654 ops,  192700 (avg:  186035) ops/sec, 18.85MB/sec (avg: 18.21MB/sec),  2.07 (avg:  2.15) msec latency
[RUN #1 75%, 201 secs]  8 threads:    37391512 ops,  172810 (avg:  185969) ops/sec, 16.91MB/sec (avg: 18.21MB/sec),  2.28 (avg:  2.15) msec latency
[RUN #1 75%, 202 secs]  8 threads:    37569063 ops,  177505 (avg:  185927) ops/sec, 17.38MB/sec (avg: 18.20MB/sec),  2.28 (avg:  2.15) msec latency
[RUN #1 75%, 203 secs]  8 threads:    37748469 ops,  179351 (avg:  185894) ops/sec, 17.55MB/sec (avg: 18.20MB/sec),  2.23 (avg:  2.15) msec latency
[RUN #1 76%, 204 secs]  8 threads:    37929971 ops,  181467 (avg:  185873) ops/sec, 17.78MB/sec (avg: 18.20MB/sec),  2.19 (avg:  2.15) msec latency
[RUN #1 76%, 205 secs]  8 threads:    38118132 ops,  188112 (avg:  185884) ops/sec, 18.41MB/sec (avg: 18.20MB/sec),  2.13 (avg:  2.15) msec latency
[RUN #1 77%, 206 secs]  8 threads:    38323058 ops,  204883 (avg:  185976) ops/sec, 20.07MB/sec (avg: 18.21MB/sec),  1.95 (avg:  2.15) msec latency
[RUN #1 77%, 207 secs]  8 threads:    38533813 ops,  210707 (avg:  186095) ops/sec, 20.62MB/sec (avg: 18.22MB/sec),  1.89 (avg:  2.14) msec latency
[RUN #1 77%, 208 secs]  8 threads:    38737511 ops,  203649 (avg:  186180) ops/sec, 19.95MB/sec (avg: 18.23MB/sec),  1.96 (avg:  2.14) msec latency
[RUN #1 78%, 209 secs]  8 threads:    38927529 ops,  189951 (avg:  186198) ops/sec, 18.60MB/sec (avg: 18.23MB/sec),  2.10 (avg:  2.14) msec latency
[RUN #1 78%, 210 secs]  8 threads:    39117910 ops,  190329 (avg:  186217) ops/sec, 18.63MB/sec (avg: 18.23MB/sec),  2.07 (avg:  2.14) msec latency
[RUN #1 79%, 211 secs]  8 threads:    39316450 ops,  198479 (avg:  186276) ops/sec, 19.44MB/sec (avg: 18.24MB/sec),  2.04 (avg:  2.14) msec latency
[RUN #1 79%, 212 secs]  8 threads:    39507698 ops,  191205 (avg:  186299) ops/sec, 18.71MB/sec (avg: 18.24MB/sec),  2.09 (avg:  2.14) msec latency
[RUN #1 79%, 213 secs]  8 threads:    39706544 ops,  198798 (avg:  186357) ops/sec, 19.48MB/sec (avg: 18.24MB/sec),  2.01 (avg:  2.14) msec latency
[RUN #1 80%, 214 secs]  8 threads:    39901099 ops,  194492 (avg:  186395) ops/sec, 19.04MB/sec (avg: 18.25MB/sec),  2.05 (avg:  2.14) msec latency
[RUN #1 80%, 215 secs]  8 threads:    40103430 ops,  202285 (avg:  186469) ops/sec, 19.81MB/sec (avg: 18.26MB/sec),  1.98 (avg:  2.14) msec latency
[RUN #1 81%, 216 secs]  8 threads:    40297130 ops,  193650 (avg:  186503) ops/sec, 18.96MB/sec (avg: 18.26MB/sec),  2.06 (avg:  2.14) msec latency
[RUN #1 81%, 217 secs]  8 threads:    40484210 ops,  187029 (avg:  186505) ops/sec, 18.30MB/sec (avg: 18.26MB/sec),  2.13 (avg:  2.14) msec latency
[RUN #1 81%, 218 secs]  8 threads:    40683290 ops,  199029 (avg:  186563) ops/sec, 19.48MB/sec (avg: 18.26MB/sec),  2.00 (avg:  2.14) msec latency
[RUN #1 82%, 219 secs]  8 threads:    40879467 ops,  196126 (avg:  186606) ops/sec, 19.20MB/sec (avg: 18.27MB/sec),  2.04 (avg:  2.14) msec latency
[RUN #1 82%, 220 secs]  8 threads:    41085408 ops,  205891 (avg:  186694) ops/sec, 20.16MB/sec (avg: 18.28MB/sec),  1.94 (avg:  2.14) msec latency
[RUN #1 83%, 221 secs]  8 threads:    41285975 ops,  200470 (avg:  186756) ops/sec, 19.63MB/sec (avg: 18.28MB/sec),  1.99 (avg:  2.14) msec latency
[RUN #1 83%, 222 secs]  8 threads:    41482107 ops,  196072 (avg:  186798) ops/sec, 19.20MB/sec (avg: 18.29MB/sec),  2.03 (avg:  2.14) msec latency
[RUN #1 83%, 223 secs]  8 threads:    41678956 ops,  196817 (avg:  186843) ops/sec, 19.28MB/sec (avg: 18.29MB/sec),  2.03 (avg:  2.14) msec latency
[RUN #1 84%, 224 secs]  8 threads:    41886781 ops,  207771 (avg:  186936) ops/sec, 20.35MB/sec (avg: 18.30MB/sec),  1.87 (avg:  2.14) msec latency
[RUN #1 84%, 225 secs]  8 threads:    42094833 ops,  207998 (avg:  187030) ops/sec, 20.36MB/sec (avg: 18.31MB/sec),  1.97 (avg:  2.13) msec latency
[RUN #1 85%, 226 secs]  8 threads:    42294364 ops,  199483 (avg:  187085) ops/sec, 19.54MB/sec (avg: 18.32MB/sec),  2.00 (avg:  2.13) msec latency
[RUN #1 85%, 227 secs]  8 threads:    42502504 ops,  208090 (avg:  187178) ops/sec, 20.37MB/sec (avg: 18.32MB/sec),  1.91 (avg:  2.13) msec latency
[RUN #1 85%, 228 secs]  8 threads:    42694128 ops,  191412 (avg:  187196) ops/sec, 18.74MB/sec (avg: 18.33MB/sec),  2.08 (avg:  2.13) msec latency
[RUN #1 86%, 229 secs]  8 threads:    42897747 ops,  203560 (avg:  187268) ops/sec, 19.93MB/sec (avg: 18.33MB/sec),  1.97 (avg:  2.13) msec latency
[RUN #1 86%, 230 secs]  8 threads:    43087935 ops,  190145 (avg:  187280) ops/sec, 18.61MB/sec (avg: 18.33MB/sec),  2.10 (avg:  2.13) msec latency
[RUN #1 87%, 231 secs]  8 threads:    43286571 ops,  198581 (avg:  187329) ops/sec, 19.43MB/sec (avg: 18.34MB/sec),  2.01 (avg:  2.13) msec latency
[RUN #1 87%, 232 secs]  8 threads:    43488228 ops,  201595 (avg:  187391) ops/sec, 19.74MB/sec (avg: 18.35MB/sec),  1.98 (avg:  2.13) msec latency
[RUN #1 87%, 233 secs]  8 threads:    43674926 ops,  186635 (avg:  187387) ops/sec, 18.26MB/sec (avg: 18.34MB/sec),  2.14 (avg:  2.13) msec latency
[RUN #1 88%, 234 secs]  8 threads:    43872364 ops,  197381 (avg:  187430) ops/sec, 19.32MB/sec (avg: 18.35MB/sec),  2.02 (avg:  2.13) msec latency
[RUN #1 88%, 235 secs]  8 threads:    44059424 ops,  187015 (avg:  187428) ops/sec, 18.30MB/sec (avg: 18.35MB/sec),  2.14 (avg:  2.13) msec latency
[RUN #1 88%, 236 secs]  8 threads:    44246218 ops,  186752 (avg:  187425) ops/sec, 18.29MB/sec (avg: 18.35MB/sec),  2.14 (avg:  2.13) msec latency
[RUN #1 89%, 237 secs]  8 threads:    44447264 ops,  200991 (avg:  187483) ops/sec, 19.66MB/sec (avg: 18.35MB/sec),  1.99 (avg:  2.13) msec latency
[RUN #1 89%, 238 secs]  8 threads:    44661725 ops,  214412 (avg:  187596) ops/sec, 21.01MB/sec (avg: 18.37MB/sec),  1.86 (avg:  2.13) msec latency
[RUN #1 90%, 239 secs]  8 threads:    44865426 ops,  203619 (avg:  187663) ops/sec, 19.94MB/sec (avg: 18.37MB/sec),  1.96 (avg:  2.13) msec latency
[RUN #1 90%, 240 secs]  8 threads:    45059009 ops,  193527 (avg:  187687) ops/sec, 18.94MB/sec (avg: 18.37MB/sec),  2.06 (avg:  2.13) msec latency
[RUN #1 91%, 241 secs]  8 threads:    45262764 ops,  203712 (avg:  187754) ops/sec, 19.95MB/sec (avg: 18.38MB/sec),  1.96 (avg:  2.13) msec latency
[RUN #1 91%, 242 secs]  8 threads:    45467012 ops,  204176 (avg:  187822) ops/sec, 20.00MB/sec (avg: 18.39MB/sec),  1.95 (avg:  2.13) msec latency
[RUN #1 91%, 243 secs]  8 threads:    45659132 ops,  191874 (avg:  187838) ops/sec, 18.79MB/sec (avg: 18.39MB/sec),  2.08 (avg:  2.13) msec latency
[RUN #1 92%, 244 secs]  8 threads:    45853740 ops,  192919 (avg:  187859) ops/sec, 18.87MB/sec (avg: 18.39MB/sec),  2.07 (avg:  2.12) msec latency
[RUN #1 92%, 245 secs]  8 threads:    46065280 ops,  211482 (avg:  187956) ops/sec, 20.71MB/sec (avg: 18.40MB/sec),  1.88 (avg:  2.12) msec latency
[RUN #1 92%, 246 secs]  8 threads:    46234397 ops,  169081 (avg:  187879) ops/sec, 16.56MB/sec (avg: 18.39MB/sec),  2.36 (avg:  2.12) msec latency
[RUN #1 93%, 247 secs]  8 threads:    46420923 ops,  186445 (avg:  187873) ops/sec, 18.25MB/sec (avg: 18.39MB/sec),  2.14 (avg:  2.12) msec latency
[RUN #1 93%, 248 secs]  8 threads:    46596290 ops,  175322 (avg:  187823) ops/sec, 17.18MB/sec (avg: 18.39MB/sec),  2.28 (avg:  2.13) msec latency
[RUN #1 94%, 249 secs]  8 threads:    46790622 ops,  194158 (avg:  187848) ops/sec, 19.00MB/sec (avg: 18.39MB/sec),  2.06 (avg:  2.12) msec latency
[RUN #1 94%, 250 secs]  8 threads:    46991452 ops,  200759 (avg:  187900) ops/sec, 19.66MB/sec (avg: 18.40MB/sec),  1.99 (avg:  2.12) msec latency
[RUN #1 94%, 251 secs]  8 threads:    47188271 ops,  196768 (avg:  187935) ops/sec, 19.25MB/sec (avg: 18.40MB/sec),  2.03 (avg:  2.12) msec latency
[RUN #1 95%, 252 secs]  8 threads:    47378731 ops,  190408 (avg:  187945) ops/sec, 18.64MB/sec (avg: 18.40MB/sec),  2.10 (avg:  2.12) msec latency
[RUN #1 95%, 253 secs]  8 threads:    47574286 ops,  195504 (avg:  187975) ops/sec, 19.13MB/sec (avg: 18.40MB/sec),  2.04 (avg:  2.12) msec latency
[RUN #1 96%, 254 secs]  8 threads:    47765652 ops,  191313 (avg:  187988) ops/sec, 18.74MB/sec (avg: 18.40MB/sec),  2.09 (avg:  2.12) msec latency
[RUN #1 96%, 255 secs]  8 threads:    47955646 ops,  189945 (avg:  187996) ops/sec, 18.59MB/sec (avg: 18.40MB/sec),  2.10 (avg:  2.12) msec latency
[RUN #1 96%, 256 secs]  8 threads:    48141355 ops,  185667 (avg:  187987) ops/sec, 18.18MB/sec (avg: 18.40MB/sec),  2.15 (avg:  2.12) msec latency
[RUN #1 97%, 257 secs]  8 threads:    48319277 ops,  178774 (avg:  187951) ops/sec, 17.49MB/sec (avg: 18.40MB/sec),  2.04 (avg:  2.12) msec latency
[RUN #1 97%, 258 secs]  8 threads:    48426174 ops,  108909 (avg:  187650) ops/sec, 10.65MB/sec (avg: 18.37MB/sec),  3.95 (avg:  2.13) msec latency
[RUN #1 97%, 259 secs]  8 threads:    48621638 ops,  199449 (avg:  187695) ops/sec, 19.50MB/sec (avg: 18.37MB/sec),  2.00 (avg:  2.13) msec latency
[RUN #1 98%, 259 secs]  8 threads:    48793792 ops,  183981 (avg:  187681) ops/sec, 18.02MB/sec (avg: 18.37MB/sec),  2.17 (avg:  2.13) msec latency
[RUN #1 98%, 260 secs]  8 threads:    48978147 ops,  236585 (avg:  187828) ops/sec, 23.17MB/sec (avg: 18.39MB/sec),  1.69 (avg:  2.13) msec latency
[RUN #1 98%, 261 secs]  8 threads:    49174233 ops,  362799 (avg:  188190) ops/sec, 35.51MB/sec (avg: 18.42MB/sec),  1.10 (avg:  2.12) msec latency
[RUN #1 99%, 261 secs]  8 threads:    49348167 ops,  349523 (avg:  188496) ops/sec, 34.22MB/sec (avg: 18.45MB/sec),  1.14 (avg:  2.12) msec latency
[RUN #1 99%, 262 secs]  8 threads:    49508723 ops,  322785 (avg:  188751) ops/sec, 31.60MB/sec (avg: 18.48MB/sec),  1.24 (avg:  2.11) msec latency
[RUN #1 99%, 262 secs]  8 threads:    49678046 ops,  423341 (avg:  189108) ops/sec, 41.41MB/sec (avg: 18.51MB/sec),  0.94 (avg:  2.11) msec latency
[RUN #1 100%, 262 secs]  8 threads:    49823831 ops,  649804 (avg:  189501) ops/sec, 63.63MB/sec (avg: 18.55MB/sec),  0.61 (avg:  2.11) msec latency
[RUN #1 100%, 263 secs]  6 threads:    49951592 ops,  649804 (avg:  189882) ops/sec, 63.63MB/sec (avg: 18.59MB/sec),  0.61 (avg:  2.10) msec latency
[RUN #1 100%, 263 secs]  0 threads:    50000000 ops,  649804 (avg:  190028) ops/sec, 63.63MB/sec (avg: 18.60MB/sec),  0.61 (avg:  2.10) msec latency


server = 10.34.93.160
port = 11300
unix socket = (null)
protocol = memcache_text
out_file = (null)
client_stats = (null)
run_count = 1
debug = 0
requests = 125000
clients = 50
threads = 8
test_time = 0
ratio = 0:1
pipeline = 1
data_size = 32
data_offset = 0
random_data = no
data_size_range = 0-0
data_size_list = 
data_size_pattern = R
expiry_range = 0-0
data_import = (null)
data_verify = no
verify_only = no
generate_keys = no
key_prefix = memtier-
key_minimum = 1
key_maximum = 50000000
key_pattern = G:G
key_stddev = 0.000000
key_median = 0.000000
reconnect_interval = 0
multi_key_get = 0
authenticate = 
select-db = 0
no-expiry = no
wait-ratio = 0:0
num-slaves = 0-0
wait-timeout = 0-0
json-out-file = (null)
8         Threads
50        Connections per thread
125000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p90 Latency     p95 Latency     p99 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets       192403.50    179866.13     12537.37         2.10097         3.13500         4.44700         9.91900     19287.95 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     192403.50    179866.13     12537.37         2.10097         3.13500         4.44700         9.91900     19287.95 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.000       100.00
---
GET       0.159         0.00
GET       0.815         5.00
GET       0.991        10.00
GET       1.103        15.00
GET       1.207        20.00
GET       1.287        25.00
GET       1.367        30.00
GET       1.447        35.00
GET       1.519        40.00
GET       1.591        45.00
GET       1.663        50.00
GET       1.695        52.50
GET       1.735        55.00
GET       1.775        57.50
GET       1.815        60.00
GET       1.855        62.50
GET       1.895        65.00
GET       1.943        67.50
GET       1.991        70.00
GET       2.047        72.50
GET       2.111        75.00
GET       2.159        76.25
GET       2.191        77.50
GET       2.239        78.75
GET       2.271        80.00
GET       2.335        81.25
GET       2.399        82.50
GET       2.463        83.75
GET       2.559        85.00
GET       2.655        86.25
GET       2.799        87.50
GET       2.879        88.12
GET       2.959        88.75
GET       3.039        89.38
GET       3.135        90.00
GET       3.247        90.62
GET       3.359        91.25
GET       3.487        91.88
GET       3.631        92.50
GET       3.791        93.12
GET       3.967        93.75
GET       4.079        94.06
GET       4.191        94.38
GET       4.319        94.69
GET       4.447        95.00
GET       4.575        95.31
GET       4.735        95.62
GET       4.927        95.94
GET       5.087        96.25
GET       5.311        96.56
GET       5.567        96.88
GET       5.695        97.03
GET       5.823        97.19
GET       5.983        97.34
GET       6.143        97.50
GET       6.335        97.66
GET       6.559        97.81
GET       6.783        97.97
GET       7.039        98.12
GET       7.327        98.28
GET       7.679        98.44
GET       7.903        98.52
GET       8.127        98.59
GET       8.383        98.67
GET       8.703        98.75
GET       9.023        98.83
GET       9.407        98.91
GET       9.855        98.98
GET      10.367        99.06
GET      10.943        99.14
GET      11.583        99.22
GET      12.031        99.26
GET      12.543        99.30
GET      13.055        99.34
GET      13.695        99.38
GET      14.335        99.41
GET      15.103        99.45
GET      15.935        99.49
GET      16.895        99.53
GET      18.047        99.57
GET      19.327        99.61
GET      20.095        99.63
GET      20.863        99.65
GET      21.759        99.67
GET      22.783        99.69
GET      23.807        99.71
GET      24.959        99.73
GET      26.111        99.75
GET      27.391        99.77
GET      28.799        99.79
GET      30.335        99.80
GET      31.103        99.81
GET      31.871        99.82
GET      32.639        99.83
GET      33.535        99.84
GET      34.303        99.85
GET      35.071        99.86
GET      36.095        99.87
GET      36.863        99.88
GET      37.887        99.89
GET      38.911        99.90
GET      39.423        99.91
GET      40.191        99.91
GET      40.703        99.92
GET      41.215        99.92
GET      41.983        99.93
GET      42.751        99.93
GET      43.263        99.94
GET      44.287        99.94
GET      45.311        99.95
GET      46.335        99.95
GET      46.847        99.95
GET      47.615        99.96
GET      48.383        99.96
GET      49.151        99.96
GET      50.175        99.96
GET      51.199        99.97
GET      52.479        99.97
GET      54.015        99.97
GET      55.551        99.97
GET      57.599        99.98
GET      58.623        99.98
GET      60.415        99.98
GET      62.207        99.98
GET      63.999        99.98
GET      67.071        99.98
GET      69.631        99.98
GET      72.191        99.98
GET      76.287        99.99
GET      78.847        99.99
GET      82.943        99.99
GET      86.015        99.99
GET      89.599        99.99
GET      93.695        99.99
GET      96.255        99.99
GET      99.327        99.99
GET     101.375        99.99
GET     103.935        99.99
GET     106.495        99.99
GET     112.639        99.99
GET     120.319        99.99
GET     123.391        99.99
GET     125.951        99.99
GET     130.559        99.99
GET     135.167       100.00
GET     141.311       100.00
GET     147.455       100.00
GET     156.671       100.00
GET     167.935       100.00
GET     185.343       100.00
GET     200.703       100.00
GET     205.823       100.00
GET     216.063       100.00
GET     228.351       100.00
GET     238.591       100.00
GET     245.759       100.00
GET     259.071       100.00
GET     276.479       100.00
GET     290.815       100.00
GET     305.151       100.00
GET     323.583       100.00
GET     333.823       100.00
GET     346.111       100.00
GET     356.351       100.00
GET     368.639       100.00
GET     380.927       100.00
GET     393.215       100.00
GET     407.551       100.00
GET     423.935       100.00
GET     438.271       100.00
GET     454.655       100.00
GET     462.847       100.00
GET     471.039       100.00
GET     479.231       100.00
GET     487.423       100.00
GET     497.663       100.00
GET     503.807       100.00
GET     511.999       100.00
GET     522.239       100.00
GET     528.383       100.00
GET     540.671       100.00
GET     544.767       100.00
GET     552.959       100.00
GET     557.055       100.00
GET     565.247       100.00
GET     569.343       100.00
GET     573.439       100.00
GET     581.631       100.00
GET     585.727       100.00
GET     589.823       100.00
GET     598.015       100.00
GET     602.111       100.00
GET     606.207       100.00
GET     606.207       100.00
GET     610.303       100.00
GET     614.399       100.00
GET     618.495       100.00
GET     626.687       100.00
GET     626.687       100.00
GET     634.879       100.00
GET     638.975       100.00
GET     638.975       100.00
GET     643.071       100.00
GET     647.167       100.00
GET     647.167       100.00
GET     655.359       100.00
GET     663.551       100.00
GET     671.743       100.00
GET     679.935       100.00
GET     684.031       100.00
GET     696.319       100.00
GET     696.319       100.00
GET     704.511       100.00
GET     704.511       100.00
GET     712.703       100.00
GET     716.799       100.00
GET     720.895       100.00
GET     724.991       100.00
GET     729.087       100.00
GET     729.087       100.00
GET     737.279       100.00
GET     737.279       100.00
GET     737.279       100.00
[...]
GET     741.375       100.00
GET     745.471       100.00
GET     745.471       100.00
GET     749.567       100.00
GET     749.567       100.00
GET     753.663       100.00
GET     757.759       100.00
GET     757.759       100.00
GET     757.759       100.00
[...]
GET     761.855       100.00
GET     761.855       100.00
GET     761.855       100.00
GET     765.951       100.00
GET     765.951       100.00
GET     765.951       100.00
[...]
GET     774.143       100.00
GET     774.143       100.00
GET     774.143       100.00
[...]
GET     778.239       100.00
GET     778.239       100.00
---
WAIT      0.000       100.00